function checkFortune() {
            var colour = document.getElementById('colour-select').value;
            var number = parseInt(document.getElementById('number-input').value, 10);
            var result = "00	ゲラ	1995.09.25	183	86	右	左  <br>
	
13	岩崎　優	1991.06.19	185	91	左	左<br>
        
14	岩貞　祐太	1991.09.05	183	87	左	左<br>

15	西　純矢	2001.09.13	184	94	右	右<br>

16	西　勇輝	1990.11.10	181	82	右	右<br>

17	青柳　晃洋	1993.12.11	183	83	右	右<br>

19	下村　海翔	2002.03.27	174	73	右	右<br>

20	森木　大智	2003.04.17	184	93	右	右<br>

21	秋山　拓巳	1991.04.26	188	101	右	左<br>
                        
26	椎葉　剛	2002.03.18	182	92	右	右<br>
                        
27	伊藤　将司	1996.05.08	178	87	左	左<br>
                        
28	鈴木　勇斗	2000.03.17	174	86	左	左<br>
                        
29	髙橋　遥人	1995.11.07	181	79	左	左   7/22 育成選手から支配下選手へ移行<br>
                        
30	門別　啓人	2004.07.10	183	86	左	左<br>	
                        
34	漆原　大晟	1996.09.10	182	85	右	左<br>	
                        
35	才木　浩人	1998.11.07	189	88	右	右<br>	
                        
36	浜地　真澄	1998.05.25	185	88	右	右<br>
                        
37	及川　雅貴	2001.04.18	184	81	左	左<br>	
                        
41	村上　頌樹	1998.06.25	175	82	右	左<br>	
                        
46	島本　浩也	1993.02.14	176	71	左	左<br>	
                        
47	桐敷　拓馬	1999.06.20	179	94	左	左<br>	
                        
48	茨木　秀俊	2004.06.08	182	87	右	右<br>
                        
49	大竹　耕太郎	1995.06.29	184	87	左	左<br>	
                        
50	富田　蓮	2001.09.06	174	76	左	左<br>	
                        
54	加治屋　蓮	1991.11.25	185	90	右	右<br>	
                        
63	石黒　佑弥	2001.06.20	180	83	右	右<br>	
                        
64	岡留　英貴	1999.11.07	181	94	右	右<br>	

65	湯浅　京己	1999.07.17	183	82	右	右<br>
                        
66	津田　淳哉	2001.08.27	178	83	右	右<br>	
                        
69	石井　大智	1997.07.29	175	80	右	右<br>	
                        
92	川原　陸	2000.12.12	186	89	左	左	7/22 育成選手から支配下選手へ移行<br>
                        
93	岩田　将貴	1998.06.16	178	75	左	左<br>	
                        
98	佐藤　蓮	1998.04.11	189	103	右	右	7/22 育成選手から支配下選手へ移行<br>
                        
99	ビーズリー	1995.11.20	191	109	右	右<br>""; // デフォルトの値
            
            if (colour === "阪神タイガース" && number ===1) {
                result = "
00	ゲラ	1995.09.25	183	86	右	左  <br>
	
13	岩崎　優	1991.06.19	185	91	左	左<br>
        
14	岩貞　祐太	1991.09.05	183	87	左	左<br>

15	西　純矢	2001.09.13	184	94	右	右<br>

16	西　勇輝	1990.11.10	181	82	右	右<br>

17	青柳　晃洋	1993.12.11	183	83	右	右<br>

19	下村　海翔	2002.03.27	174	73	右	右<br>

20	森木　大智	2003.04.17	184	93	右	右<br>

21	秋山　拓巳	1991.04.26	188	101	右	左<br>
                        
26	椎葉　剛	2002.03.18	182	92	右	右<br>
                        
27	伊藤　将司	1996.05.08	178	87	左	左<br>
                        
28	鈴木　勇斗	2000.03.17	174	86	左	左<br>
                        
29	髙橋　遥人	1995.11.07	181	79	左	左   7/22 育成選手から支配下選手へ移行<br>
                        
30	門別　啓人	2004.07.10	183	86	左	左<br>	
                        
34	漆原　大晟	1996.09.10	182	85	右	左<br>	
                        
35	才木　浩人	1998.11.07	189	88	右	右<br>	
                        
36	浜地　真澄	1998.05.25	185	88	右	右<br>
                        
37	及川　雅貴	2001.04.18	184	81	左	左<br>	
                        
41	村上　頌樹	1998.06.25	175	82	右	左<br>	
                        
46	島本　浩也	1993.02.14	176	71	左	左<br>	
                        
47	桐敷　拓馬	1999.06.20	179	94	左	左<br>	
                        
48	茨木　秀俊	2004.06.08	182	87	右	右<br>
                        
49	大竹　耕太郎	1995.06.29	184	87	左	左<br>	
                        
50	富田　蓮	2001.09.06	174	76	左	左<br>	
                        
54	加治屋　蓮	1991.11.25	185	90	右	右<br>	
                        
63	石黒　佑弥	2001.06.20	180	83	右	右<br>	
                        
64	岡留　英貴	1999.11.07	181	94	右	右<br>	

65	湯浅　京己	1999.07.17	183	82	右	右<br>
                        
66	津田　淳哉	2001.08.27	178	83	右	右<br>	
                        
69	石井　大智	1997.07.29	175	80	右	右<br>	
                        
92	川原　陸	2000.12.12	186	89	左	左	7/22 育成選手から支配下選手へ移行<br>
                        
93	岩田　将貴	1998.06.16	178	75	左	左<br>	
                        
98	佐藤　蓮	1998.04.11	189	103	右	右	7/22 育成選手から支配下選手へ移行<br>
                        
99	ビーズリー	1995.11.20	191	109	右	右<br>";
            } else if (colour === "黒" && number === 1) {
                result = "中吉";
            } else if (colour === "黒" && number === 2) {
                result = "凶";
            } else if (colour === "白" && number === 0) {
                result = "中吉";
            } else if (colour === "白" && number === 1) {
                result = "中吉";
            } else if (colour === "白" && number === 2) {
                result = "大凶";
            } else if (colour === "オレンジ" && number === 0) {
                result = "凶";
            } else if (colour === "オレンジ" && number === 1) {
                result = "大吉";
            } else if (colour === "オレンジ" && number === 2) {
                result = "中吉";
            }

            document.getElementById('result-output').innerText = "あなたの今週の運勢は【" + result + "】です";
        }
